raw/Dotfile-Management-and-Documentation-with-Org-mode-NSConflict-lujun9972.org
#+URL: https://expoundite.net/guides/dotfile-management

某一天,'polm23'在Hack News上提了个问题, [[https://news.ycombinator.com/item?id=11070797][你们都是怎么管理dotfiles的]]. 我分享了一下我的方法并贴上了[[https://news.ycombinator.com/item?id=11070970][两个例子]]. 
Turns out, rare for me, I stumbled upon an original way to edit, document and deploy dotfiles. 
虽然我们Emacs用户早已开始用Org-Mode来管理.emacs文件了, 但还是只有极少数的人用它来管理其他的dotfile.

用Org-Mode来管理dotfile,我至少能想到三个优势.

+ 你可以对每一行的配置都加上文档说明. 你可以记录下你是什么时候写下这行配置的,为什么要写下这行配置. 你也可以在这段代码块附件记下其他可能的配置,这样你就无需老是去查看man或其他文档信息了.
+ 你不再需要创建那些容易出错的符号链接了. 我们经常会写出像 =ln -s dotfiles/vimrc ~/.vimrc= 这样的创建符号链接对吧? 
  即使我们记得总是在创建符号链接时使用绝对路径,那当你想把dotfile从BSD迁移到Linux时怎么办呢? =~= 在两个系统可是表示不同路径的呀!
  当然,你可以在发布脚本中为不同操作系统创建不同的分支,但是借助Org-Mode,你根本无需这么麻烦.
+ 你甚至可以管理远程服务器上的dotfile. Org-Mode可以将代码块'tangle'到远程主机上去, 所以你可以象管理本机上的 =.bashrc= 一样管理服务器上的 =nginx.conf= 文件.

* 1 Here's how

** 1.1 Requirements

24.x及以上版本的Emacs, 8.x或更新的Org-Mode, 还有你最喜爱的键盘.

然后在Emacs中创建一个新文件,你可以把它叫做 =dotfiles.org= 或其他什么名字.

** 1.2 "Normal" dotfiles

这些文件直接就存放在你的home目录下. 因此可以很直接的在Emacs中管理这些文件. 为了便于组织,你可以将同类的文件放在同一个标题下. 
比如,对于那些与email相关的文件,你可以创建这样一些标题:

#+BEGIN_SRC org
  ,* Email
  ,** Muttrc
  ,** Aliases
  ,** goobookrc
#+END_SRC

然后将你文件的内容放在每个子标题下的代码块中,像这样:

#+BEGIN_SRC org
  ,* Email
  ,** Muttrc
   ,#+BEGIN_SRC conf :tangle ~/.muttrc
   #source "/etc/Muttrc"   # Not available on OS X
   source "gpg --batch --passphrase-file ~/.sec/.passphrase --textmode -d ~/.sec/mutt.gpg |"
   set realname="Haoyang Xu"

   set sig_dashes

   ...

   ,#+END_SRC
#+END_SRC

这样一来,当你运行 =M-x org-babel-tangle= 或按下 =C-c C-v t= 时,上面代码块的内容会写入到 =$HOME/.muttrc= 文件中, 并覆盖原内容.

其他的子标题也是一样的处理方式:

#+BEGIN_SRC org
  ,* Email
  ,** Muttrc ...
  ,** Aliases
    ,#+BEGIN_SRC conf :tangle ~/.aliases
    alias mumon      foobar@example.com
    ,#+END_SRC
  ,** goobookrc
    ,#+BEGIN_SRC conf :tangle ~/.goobookrc
    [DEFAULT]
     # The following are optional, defaults are shown

     # This file is written by the oauth library, and should be kept secure,
     # it's like a password to your google contacts.
     ;oauth_db_filename: ~/.goobook_auth.json

     # The client secret file is not really secret.
     ;client_secret_filename: ~/.goobook_client_secret.json

     ;cache_filename: ~/.goobook_cache
     ;cache_expiry_hours: 24
     ;filter_groupless_contacts: yes
    ,#+END_SRC
#+END_SRC

现在当你执行 =org-babel-tangle= 后,会产生3个dotfile. 你可以将这个org文件纳入到版本控制系统中,在Emacs中编辑dotfile然后一键发布它们.
deploy them with one command.

** 1.3 Dotfiles in a dotdir

假设,你想管理你的存放在 =.ssh= 目录下的SSH配置文件. 它的管理方式大致上与上面的没什么两样.
不过如果你是在一台新机器上,尚没有 =.ssh= 目录,那Org-mode在tangle时会报错.

这种情况下,你需要在文件的开头写上一行:

#+BEGIN_SRC org
  # -*- eval: (make-directory ".ssh" "~") -*-
#+END_SRC

你也可以在文件开始前创建一个代码块来帮你运行创建目录的命令.

#+BEGIN_SRC org
  ,#+BEGIN_SRC sh
  mkdir ~/.ssh
  ,#+END_SRC
#+END_SRC

不过,最好的方法还是设置header argument =mkdirpl= 为 =yes=. 像这样:

#+BEGIN_SRC org
  ,#+BEGIN_SRC sh :mkdirp yes :tangle ~/.ssh/config
  (your .ssh/config contents)
  ,#+END_SRC
#+END_SRC

这样一来,若没有 =.ssh= 目录的话,Org-Mode会自动帮你创建.

** 1.4 Emacs dotfiles

如果你是采用的老旧的 =.emacs= 或 =init.el= 来存放你的Emacs配置,那么管理的方法跟上面说的一样.
然而,若你的配置本来就是嵌入到其他.org文件中的,我想你应该不会喜欢把这些org文件的内容再放到 =dotfile.org= 中的org代码块中.
我的解决方案是在 =home.org(我的dotfile)= 所在目录下创建一个目录来存放这些Emacs dotfile.
这种方法不太完美,不过我目前也没有其他什么好的方法了. 这还真是讽刺啊.

** 1.5 Credentials and secrets

若你把你的dotfile放到网上去,那么你需要给dotfile加密. 好在,Emacs对加解密文件支持得很好.
你把那些不想公开的东西写入一个特定的org问你就暗中,然后用 =epa-encrypt-file= 来将该文件进行加密,加密后的文件以 =.gpg= 为后缀. 然后你就可以删掉明文的org文件了. 
下一次你在编辑加密过的 =.org.gpg= 文件时, Emacs会通过 =gpg-agent= 提示你输入密码,然后自动为你解密.

