blog/2016/10/24/dotfile-management-and-documentation-with-org-mode-nsconflict-lujun9972/index.html
<!DOCTYPE html>
<html lang="en">
<head>
  <title>Dotfile-Management-and-Documentation-with-Org-mode-NSConflict-lujun9972 - EMACS-DOCUMENT</title>
  <meta charset="utf-8" />
  <meta http-equiv="X-UA-Compatible" content="IE=edge"/>
  <meta name="viewport"
        content="width=device-width, initial-scale=1, maximum-scale=1, user-scalable=no"/>
  <meta name="author" content="lujun9972" />
  <link rel="stylesheet" href="http://lujun9972.github.io/emacs-document/media/css/main.css" type="text/css"/>
  <link rel="stylesheet" href="http://lujun9972.github.io/emacs-document/media/css/comment.css" type="text/css"/>
</head>

  <body><div class="container">
<div>
  <header class="masthead">
    <h1 class="masthead-title"><a href="http://lujun9972.github.io/emacs-document/">EMACS-DOCUMENT</a></h1>
    <p>=============&gt;集思广益</p>
    <nav class="site-nav">
      <div class="menu-icon">
        <svg viewBox="0 0 18 15">
          <path d="M18,1.484c0,0.82-0.665,1.484-1.484,1.484H1.484C0.665,2.969,0,2.304,0,1.484l0,0C0,0.665,0.665,0,1.484,0 h15.031C17.335,0,18,0.665,18,1.484L18,1.484z" fill="#ffff00"/>
          <path d="M18,7.516C18,8.335,17.335,9,16.516,9H1.484C0.665,9,0,8.335,0,7.516l0,0c0-0.82,0.665-1.484,1.484-1.484 h15.031C17.335,6.031,18,6.696,18,7.516L18,7.516z" fill="#ffff00"/>
          <path d="M18,13.516C18,14.335,17.335,15,16.516,15H1.484C0.665,15,0,14.335,0,13.516l0,0 c0-0.82,0.665-1.484,1.484-1.484h15.031C17.335,12.031,18,12.696,18,13.516L18,13.516z" fill="#ffff00"/>
        </svg>
      </div>
      <ul class="trigger">
        <li><a href="http://lujun9972.github.io/emacs-document/years/">Years</a></li>
        <li><a href="http://lujun9972.github.io/emacs-document/authors/">Authors</a></li>
        <li><a href="http://lujun9972.github.io/emacs-document/tags/">Tags</a></li>
        <li><a href="http://lujun9972.github.io/emacs-document/about/">About</a></li>
        <li><a href="https://github.com/lujun9972/emacs-document">Github</a></li>
        <li><a href="http://lujun9972.github.io/emacs-document/rss.xml">RSS</a></li>
      </ul>
    </nav>
    <form method="get" id="searchform" action="http://www.google.com/search">
      <input type="text" class="field" name="q" id="s" placeholder="Search">
      <input type="hidden" name="as_sitesearch" value="lujun9972.github.io/emacs-document">
    </form>
  </header>
</div>

<div>
<div class="post">
<h1 class="title">Dotfile-Management-and-Documentation-with-Org-mode-NSConflict-lujun9972</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline6">1. 1 Here's how</a>
<ul>
<li><a href="#orgheadline1">1.1. 1.1 Requirements</a></li>
<li><a href="#orgheadline2">1.2. 1.2 "Normal" dotfiles</a></li>
<li><a href="#orgheadline3">1.3. 1.3 Dotfiles in a dotdir</a></li>
<li><a href="#orgheadline4">1.4. 1.4 Emacs dotfiles</a></li>
<li><a href="#orgheadline5">1.5. 1.5 Credentials and secrets</a></li>
</ul>
</li>
<li><a href="#orgheadline7">2. 2 Documenting changes</a></li>
<li><a href="#orgheadline8">3. 3 Managing remote dotfiles and configs</a></li>
<li><a href="#orgheadline9">4. 4 Caveats</a></li>
<li><a href="#orgheadline10">5. 5 Acknowledgements</a></li>
</ul>
</div>
</div>
<p>
某一天,'polm23'在Hack News上提了个问题, <a href="https://news.ycombinator.com/item?id=11070797">你们都是怎么管理dotfiles的</a>. 我分享了一下我的方法并贴上了<a href="https://news.ycombinator.com/item?id=11070970">两个例子</a>. 
Turns out, rare for me, I stumbled upon an original way to edit, document and deploy dotfiles. 
虽然我们Emacs用户早已开始用Org-Mode来管理.emacs文件了, 但还是只有极少数的人用它来管理其他的dotfile.
</p>

<p>
用Org-Mode来管理dotfile,我至少能想到三个优势.
</p>

<ul class="org-ul">
<li>你可以对每一行的配置都加上文档说明. 你可以记录下你是什么时候写下这行配置的,为什么要写下这行配置. 你也可以在这段代码块附件记下其他可能的配置,这样你就无需老是去查看man或其他文档信息了.</li>
<li>你不再需要创建那些容易出错的符号链接了. 我们经常会写出像 <code>ln -s dotfiles/vimrc ~/.vimrc</code> 这样的创建符号链接对吧? 
即使我们记得总是在创建符号链接时使用绝对路径,那当你想把dotfile从BSD迁移到Linux时怎么办呢? <code>~</code> 在两个系统可是表示不同路径的呀!
当然,你可以在发布脚本中为不同操作系统创建不同的分支,但是借助Org-Mode,你根本无需这么麻烦.</li>
<li>你甚至可以管理远程服务器上的dotfile. Org-Mode可以将代码块'tangle'到远程主机上去, 所以你可以象管理本机上的 <code>.bashrc</code> 一样管理服务器上的 <code>nginx.conf</code> 文件.</li>
</ul>

<div id="outline-container-orgheadline6" class="outline-2">
<h2 id="orgheadline6"><span class="section-number-2">1</span> 1 Here's how</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-orgheadline1" class="outline-3">
<h3 id="orgheadline1"><span class="section-number-3">1.1</span> 1.1 Requirements</h3>
<div class="outline-text-3" id="text-1-1">
<p>
24.x及以上版本的Emacs, 8.x或更新的Org-Mode, 还有你最喜爱的键盘.
</p>

<p>
然后在Emacs中创建一个新文件,你可以把它叫做 <code>dotfiles.org</code> 或其他什么名字.
</p>
</div>
</div>

<div id="outline-container-orgheadline2" class="outline-3">
<h3 id="orgheadline2"><span class="section-number-3">1.2</span> 1.2 "Normal" dotfiles</h3>
<div class="outline-text-3" id="text-1-2">
<p>
这些文件直接就存放在你的home目录下. 因此可以很直接的在Emacs中管理这些文件. 为了便于组织,你可以将同类的文件放在同一个标题下. 
比如,对于那些与email相关的文件,你可以创建这样一些标题:
</p>

<div class="org-src-container">

<pre class="src src-org"><span style="color: #4f97d7; font-size: 130%; font-weight: bold;">* Email</span>
<span style="color: #292b2e;">*</span><span style="color: #2d9574; font-size: 120%; font-weight: bold;">* Muttrc</span>
<span style="color: #292b2e;">*</span><span style="color: #2d9574; font-size: 120%; font-weight: bold;">* Aliases</span>
<span style="color: #292b2e;">*</span><span style="color: #2d9574; font-size: 120%; font-weight: bold;">* goobookrc</span>
</pre>
</div>

<p>
然后将你文件的内容放在每个子标题下的代码块中,像这样:
</p>

<div class="org-src-container">

<pre class="src src-org"><span style="color: #4f97d7; font-size: 130%; font-weight: bold;">* Email</span>
<span style="color: #292b2e;">*</span><span style="color: #2d9574; font-size: 120%; font-weight: bold;">* Muttrc</span>
<span style="color: #827591; background-color: #373040;"> #+BEGIN_SRC conf :tangle ~/.muttrc</span>
 <span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">source "/etc/Muttrc"   # Not available on OS X</span>
 <span style="color: #7590db;">source</span> <span style="color: #2d9574;">"gpg --batch --passphrase-file ~/.sec/.passphrase --textmode -d ~/.sec/mutt.gpg |"</span>
 <span style="color: #7590db;">set</span> realname=<span style="color: #2d9574;">"Haoyang Xu"</span>

 <span style="color: #7590db;">set</span> sig_dashes

 <span style="color: #7590db;">...</span>

<span style="color: #827591; background-color: #373040;"> #+END_SRC</span>
</pre>
</div>

<p>
这样一来,当你运行 <code>M-x org-babel-tangle</code> 或按下 <code>C-c C-v t</code> 时,上面代码块的内容会写入到 <code>$HOME/.muttrc</code> 文件中, 并覆盖原内容.
</p>

<p>
其他的子标题也是一样的处理方式:
</p>

<div class="org-src-container">

<pre class="src src-org"><span style="color: #4f97d7; font-size: 130%; font-weight: bold;">* Email</span>
<span style="color: #292b2e;">*</span><span style="color: #2d9574; font-size: 120%; font-weight: bold;">* Muttrc ...</span>
<span style="color: #292b2e;">*</span><span style="color: #2d9574; font-size: 120%; font-weight: bold;">* Aliases</span>
<span style="color: #827591; background-color: #373040;">  #+BEGIN_SRC conf :tangle ~/.aliases</span>
  <span style="color: #7590db;">alias</span> mumon      foobar@example.com
<span style="color: #827591; background-color: #373040;">  #+END_SRC</span>
<span style="color: #292b2e;">*</span><span style="color: #2d9574; font-size: 120%; font-weight: bold;">* goobookrc</span>
<span style="color: #827591; background-color: #373040;">  #+BEGIN_SRC conf :tangle ~/.goobookrc</span>
  [<span style="color: #ce537a; font-weight: bold;">DEFAULT</span>]
   # The following are optional, defaults are shown

   # This file is written by the oauth library, and should be kept secure,
   # it's like a password to your google contacts.
   ;oauth_db_filename: ~/.goobook_auth.json

   # The client secret file is not really secret.
   ;client_secret_filename: ~/.goobook_client_secret.json

   ;cache_filename: ~/.goobook_cache
   ;cache_expiry_hours: 24
   ;filter_groupless_contacts: yes
<span style="color: #827591; background-color: #373040;">  #+END_SRC</span>
</pre>
</div>

<p>
现在当你执行 <code>org-babel-tangle</code> 后,会产生3个dotfile. 你可以将这个org文件纳入到版本控制系统中,在Emacs中编辑dotfile然后一键发布它们.
deploy them with one command.
</p>
</div>
</div>

<div id="outline-container-orgheadline3" class="outline-3">
<h3 id="orgheadline3"><span class="section-number-3">1.3</span> 1.3 Dotfiles in a dotdir</h3>
<div class="outline-text-3" id="text-1-3">
<p>
假设,你想管理你的存放在 <code>.ssh</code> 目录下的SSH配置文件. 它的管理方式大致上与上面的没什么两样.
不过如果你是在一台新机器上,尚没有 <code>.ssh</code> 目录,那Org-mode在tangle时会报错.
</p>

<p>
这种情况下,你需要在文件的开头写上一行:
</p>

<div class="org-src-container">

<pre class="src src-org"><span style="color: #2aa1ae; background-color: #292e34;"># -*- eval: (make-directory ".ssh" "~") -*-</span>
</pre>
</div>

<p>
你也可以在文件开始前创建一个代码块来帮你运行创建目录的命令.
</p>

<div class="org-src-container">

<pre class="src src-org"><span style="color: #827591; background-color: #373040;">#+BEGIN_SRC sh</span>
mkdir ~/.ssh
<span style="color: #827591; background-color: #373040;">#+END_SRC</span>
</pre>
</div>

<p>
不过,最好的方法还是设置header argument <code>mkdirpl</code> 为 <code>yes</code>. 像这样:
</p>

<div class="org-src-container">

<pre class="src src-org"><span style="color: #827591; background-color: #373040;">#+BEGIN_SRC sh :mkdirp yes :tangle ~/.ssh/config</span>
<span style="color: #4f97d7;">(</span>your .ssh/config contents<span style="color: #4f97d7;">)</span>
<span style="color: #827591; background-color: #373040;">#+END_SRC</span>
</pre>
</div>

<p>
这样一来,若没有 <code>.ssh</code> 目录的话,Org-Mode会自动帮你创建.
</p>
</div>
</div>

<div id="outline-container-orgheadline4" class="outline-3">
<h3 id="orgheadline4"><span class="section-number-3">1.4</span> 1.4 Emacs dotfiles</h3>
<div class="outline-text-3" id="text-1-4">
<p>
如果你是采用的老旧的 <code>.emacs</code> 或 <code>init.el</code> 来存放你的Emacs配置,那么管理的方法跟上面说的一样.
然而,若你的配置本来就是嵌入到其他.org文件中的,我想你应该不会喜欢把这些org文件的内容再放到 <code>dotfile.org</code> 中的org代码块中.
我的解决方案是在 <code>home.org(我的dotfile)</code> 所在目录下创建一个目录来存放这些Emacs dotfile.
这种方法不太完美,不过我目前也没有其他什么好的方法了. 这还真是讽刺啊.
</p>
</div>
</div>

<div id="outline-container-orgheadline5" class="outline-3">
<h3 id="orgheadline5"><span class="section-number-3">1.5</span> 1.5 Credentials and secrets</h3>
<div class="outline-text-3" id="text-1-5">
<p>
若你把你的dotfile放到网上去,那么你需要给dotfile加密. 好在,Emacs对加解密文件支持得很好.
你把那些不想公开的东西写入一个特定的org问你就暗中,然后用 <code>epa-encrypt-file</code> 来将该文件进行加密,加密后的文件以 <code>.gpg</code> 为后缀. 然后你就可以删掉明文的org文件了. 
下一次你在编辑加密过的 <code>.org.gpg</code> 文件时, Emacs会通过 <code>gpg-agent</code> 提示你输入密码,然后自动为你解密.
</p>
</div>
</div>
</div>
