raw/Dotfile-Management-and-Documentation-with-Org-mode-NSConflict-lujun9972.org
* 2 Documenting changes

上面的方法能够让你简单而快速的把所有的dotfile都放到少量的org文件中去. 但是仅仅这样还不够. 用Org-mode来管理dotfile的好处更在于能够无缝的整合文档说明,并且能够快速的进行部署.

你可以把一段非常长的配置内容细分到多个代码块中去,然后在部署时将这些代码块中的内容整合到一个文件中去.
你甚至可以把这些代码块放置在不同的子标题下.

这种情况下, 你无需为每个代码块的属性(官方文档称之为head arguments)都设置以此要写到哪个文件中, 你可以直接在标题的属性中(为该标题下的所有代码块)指定该文件的路径.
下面举个例子:

#+BEGIN_SRC org
  ,* Git
    :PROPERTIES:
    :tangle:   ~/.gitconfig   # <- all src blocks under this 'Git' subtree will be written to ~/.gitconfig
    :END:
  ,** personal information
  ,#+BEGIN_SRC conf
    [user]
    name = John Doe
    email = john.doe@example.net
  ,#+END_SRC
  ,** push settings
  ,#+BEGIN_SRC conf
    [push]
    default = upstream
  ,#+END_SRC
  ...
#+END_SRC

当你tangle该文件时,所有 =* Git= 子树下的代码块都会被写入到 =$HOME/.gitconfig= 中.

现在假设我们要修改一下Git的推送配置,我们可以很方便的定位到相关位置然后做出一些修改:

#+BEGIN_SRC org
  ,** push settings
  ,#+BEGIN_SRC conf
    [push]
    default = simple
  ,#+END_SRC
#+END_SRC

过了一段时候后,你可能就会忘记改了哪部分内容了. 那么为什么为这次的修改留下一些笔记呢?

#+BEGIN_SRC org
  ,** push settings
  ,#+BEGIN_SRC conf
    [push]
    default = simple
  ,#+END_SRC
  [2016-03-19 Sat 22:31] change push default from 'upstream' to 'simple'.
#+END_SRC

你可以在几乎任何位置通过按下 =C-u C-c != 来插入一段时间戳. 如果你只需要插入日期而不关心具体的时间,那么你可以按下 =C=c != 来插入.

如果你经常需要修改某项配置,可以考虑为所有可能的选项加上说明:

#+BEGIN_SRC org
  ,** push settings
  With ~push.default~ set to ~simple~, ~git push~ will fail if the current local branch is not tracking a remote branch, even if remote has a branch with the same name. This seems to be the safest option. Other possible values are:

   - ~upstream~: push the local branch to its upstream branch.
   - ~current~: push the local branch to a branch of the same name.

  ,#+BEGIN_SRC conf
    [push]
    default = simple
  ,#+END_SRC
  [2016-03-19 Sat 22:31] change push default from 'upstream' to 'simple'.
#+END_SRC

有时,你可能想体验一下各类选项的组合效果,你可以将这些组合都写下来,然后告诉Org-mode不要tangle其中的某些代码块:

#+BEGIN_SRC conf :tangle no
safe_threshold=1
encryption_mechanism=ECDHE_RSA
#+END_SRC

#+BEGIN_SRC conf
safe_threshold=0
encryption_mechanism=HMAC-SHA1
#+END_SRC

上面例子中,只有后面的代码块会被写入配置文件中.

* 3 Managing remote dotfiles and configs

In :tangle head argument or subtree property, you can specify a remote
location, typically a remote server which you have SSH access. Suppose you are
in charge of a web server, you can save yourself a lot of remote editing by
using Org-Mode to manage its configuration:

#+BEGIN_SRC org
  ,* Nginx
    :PROPERTIES:
    :tangle:   /webadmin@ssh.example.org:configs/nginx.conf
  ,#+BEGIN_SRC conf
    worker_processes 4;

    events { worker_connections 1024; }
    ...
  ,#+END_SRC

  ,#+BEGIN_SRC sh :dir /ssh:webadmin@ssh.example.org|sudo:ssh.example.org :tangle no
  cp /home/webadmin/configs/nginx.conf /etc/nginx/
  chown nginx:nginx /etc/nginx/nginx.conf
  ,#+END_SRC
#+END_SRC

The first code block get tangled into the remote file /home/webadmin/
nginx.conf, the second code block has :tangle no and will not be tangled into
any file, but you can run the code block from your local Emacs, it will ask
you your sudo password, and copy the file to the right location and set
owners.

* 4 Caveats

  * Emacs is single-threaded. If you use Org-Mode to deal with files/shells on
    remote systems through a slow connection, you will have to wait during
    tangling remote files and executing remote commands.
  * You don't have to deal with symlinks, and you don't get its benefits. For
    example, you change your Git settings through command git config --global
    .... Such changes don't automatically get updated in your Org-Mode file.
    It is your responsibility to update your dotfile.org by hand.
      + UPDATE: Ken Mankoff sends me a tip that partially solves the problem.
        You can add the following line to the top of your dotfile.org:
       
        #+BEGIN_SRC org
          ,#+PROPERTY: header-args:conf  :comments link :tangle-mode (identity #o444)
        #+END_SRC
        
        In Ken's own words: "This makes the files read-only, so I can't edit
        them by mistake. It also creates a commented link at the top of each,
        so I can jump from the dotfile to its Org origin if I open the dotfile
        by mistake." Kudos.
       
  * Your dotfile.org may become to big and unwieldy. For most people this is
    not a big deal. On my late-2012 MacBook Pro, opening Org files of a few
    hundred KB is as smooth as opening a new file. But if this system is used
    for a long time, the files may grow with all those logs and documents. In
    that case, you may want to split the files by, say, putting each top-level
    headline in a separate file. It is easy to create links to other files in
    Org-Mode, so you can still conveniently navigate through all the files.

