blog/2016/10/24/dotfile-management-and-documentation-with-org-mode-nsconflict-lujun9972/index.html

<div id="outline-container-orgheadline7" class="outline-2">
<h2 id="orgheadline7"><span class="section-number-2">2</span> 2 Documenting changes</h2>
<div class="outline-text-2" id="text-2">
<p>
上面的方法能够让你简单而快速的把所有的dotfile都放到少量的org文件中去. 但是仅仅这样还不够. 用Org-mode来管理dotfile的好处更在于能够无缝的整合文档说明,并且能够快速的进行部署.
</p>

<p>
你可以把一段非常长的配置内容细分到多个代码块中去,然后在部署时将这些代码块中的内容整合到一个文件中去.
你甚至可以把这些代码块放置在不同的子标题下.
</p>

<p>
这种情况下, 你无需为每个代码块的属性(官方文档称之为head arguments)都设置以此要写到哪个文件中, 你可以直接在标题的属性中(为该标题下的所有代码块)指定该文件的路径.
下面举个例子:
</p>

<div class="org-src-container">

<pre class="src src-org"><span style="color: #4f97d7; font-size: 130%; font-weight: bold;">* Git</span>
<span style="color: #bc6ec5;">  :PROPERTIES:</span>
  <span style="color: #bc6ec5;">:tangle:</span>   ~/.gitconfig   # &lt;- all src blocks under this 'Git' subtree will be written to ~/.gitconfig
<span style="color: #bc6ec5;">  :END:</span>
<span style="color: #292b2e;">*</span><span style="color: #2d9574; font-size: 120%; font-weight: bold;">* personal information</span>
<span style="color: #827591; background-color: #373040;">#+BEGIN_SRC conf</span>
  [<span style="color: #ce537a; font-weight: bold;">user</span>]
  <span style="color: #7590db;">name</span> = John Doe
  <span style="color: #7590db;">email</span> = john.doe@example.net
<span style="color: #827591; background-color: #373040;">#+END_SRC</span>
<span style="color: #292b2e;">*</span><span style="color: #2d9574; font-size: 120%; font-weight: bold;">* push settings</span>
<span style="color: #827591; background-color: #373040;">#+BEGIN_SRC conf</span>
  [<span style="color: #ce537a; font-weight: bold;">push</span>]
  <span style="color: #7590db;">default</span> = upstream
<span style="color: #827591; background-color: #373040;">#+END_SRC</span>
...
</pre>
</div>

<p>
当你tangle该文件时,所有 <code>* Git</code> 子树下的代码块都会被写入到 <code>$HOME/.gitconfig</code> 中.
</p>

<p>
现在假设我们要修改一下Git的推送配置,我们可以很方便的定位到相关位置然后做出一些修改:
</p>

<div class="org-src-container">

<pre class="src src-org"><span style="color: #292b2e;">*</span><span style="color: #2d9574; font-size: 120%; font-weight: bold;">* push settings</span>
<span style="color: #827591; background-color: #373040;">#+BEGIN_SRC conf</span>
  [<span style="color: #ce537a; font-weight: bold;">push</span>]
  <span style="color: #7590db;">default</span> = simple
<span style="color: #827591; background-color: #373040;">#+END_SRC</span>
</pre>
</div>

<p>
过了一段时候后,你可能就会忘记改了哪部分内容了. 那么为什么为这次的修改留下一些笔记呢?
</p>

<div class="org-src-container">

<pre class="src src-org"><span style="color: #292b2e;">*</span><span style="color: #2d9574; font-size: 120%; font-weight: bold;">* push settings</span>
<span style="color: #827591; background-color: #373040;">#+BEGIN_SRC conf</span>
  [<span style="color: #ce537a; font-weight: bold;">push</span>]
  <span style="color: #7590db;">default</span> = simple
<span style="color: #827591; background-color: #373040;">#+END_SRC</span>
<span style="color: #7590db; text-decoration: underline;">[2016-03-19 Sat 22:31]</span> change push default from 'upstream' to 'simple'.
</pre>
</div>

<p>
你可以在几乎任何位置通过按下 <code>C-u C-c !</code> 来插入一段时间戳. 如果你只需要插入日期而不关心具体的时间,那么你可以按下 <code>C=c !</code> 来插入.
</p>

<p>
如果你经常需要修改某项配置,可以考虑为所有可能的选项加上说明:
</p>

<div class="org-src-container">

<pre class="src src-org"><span style="color: #292b2e;">*</span><span style="color: #2d9574; font-size: 120%; font-weight: bold;">* push settings</span>
With <span style="color: #28def0;">~push.default~</span> set to <span style="color: #28def0;">~simple~</span>, <span style="color: #28def0;">~git push~</span> will fail if the current local branch is not tracking a remote branch, even if remote has a branch with the same name. This seems to be the safest option. Other possible values are:

 - <span style="color: #28def0;">~upstream~</span>: push the local branch to its upstream branch.
 - <span style="color: #28def0;">~current~</span>: push the local branch to a branch of the same name.

<span style="color: #827591; background-color: #373040;">#+BEGIN_SRC conf</span>
  [<span style="color: #ce537a; font-weight: bold;">push</span>]
  <span style="color: #7590db;">default</span> = simple
<span style="color: #827591; background-color: #373040;">#+END_SRC</span>
<span style="color: #7590db; text-decoration: underline;">[2016-03-19 Sat 22:31]</span> change push default from 'upstream' to 'simple'.
</pre>
</div>

<p>
有时,你可能想体验一下各类选项的组合效果,你可以将这些组合都写下来,然后告诉Org-mode不要tangle其中的某些代码块:
</p>

<div class="org-src-container">

<pre class="src src-conf"><span style="color: #7590db;">safe_threshold</span>=1
<span style="color: #7590db;">encryption_mechanism</span>=ECDHE_RSA
</pre>
</div>

<div class="org-src-container">

<pre class="src src-conf"><span style="color: #7590db;">safe_threshold</span>=0
<span style="color: #7590db;">encryption_mechanism</span>=HMAC-SHA1
</pre>
</div>

<p>
上面例子中,只有后面的代码块会被写入配置文件中.
</p>
</div>
</div>

<div id="outline-container-orgheadline8" class="outline-2">
<h2 id="orgheadline8"><span class="section-number-2">3</span> 3 Managing remote dotfiles and configs</h2>
<div class="outline-text-2" id="text-3">
<p>
In :tangle head argument or subtree property, you can specify a remote
location, typically a remote server which you have SSH access. Suppose you are
in charge of a web server, you can save yourself a lot of remote editing by
using Org-Mode to manage its configuration:
</p>

<div class="org-src-container">

<pre class="src src-org"><span style="color: #4f97d7; font-size: 130%; font-weight: bold;">* Nginx</span>
<span style="color: #bc6ec5;">  :PROPERTIES:</span>
  <span style="color: #bc6ec5;">:tangle:</span>   /webadmin@ssh.example.org:configs/nginx.conf
<span style="color: #827591; background-color: #373040;">#+BEGIN_SRC conf</span>
  <span style="color: #7590db;">worker_processes</span> 4;

  <span style="color: #7590db;">events</span> { worker_connections 1024; }
  <span style="color: #7590db;">...</span>
<span style="color: #827591; background-color: #373040;">#+END_SRC</span>

<span style="color: #827591; background-color: #373040;">#+BEGIN_SRC sh :dir /ssh:webadmin@ssh.example.org|sudo:ssh.example.org :tangle no</span>
cp /home/webadmin/configs/nginx.conf /etc/nginx/
chown nginx:nginx /etc/nginx/nginx.conf
<span style="color: #827591; background-color: #373040;">#+END_SRC</span>
</pre>
</div>

<p>
The first code block get tangled into the remote file <i>home/webadmin</i>
nginx.conf, the second code block has :tangle no and will not be tangled into
any file, but you can run the code block from your local Emacs, it will ask
you your sudo password, and copy the file to the right location and set
owners.
</p>
</div>
</div>

<div id="outline-container-orgheadline9" class="outline-2">
<h2 id="orgheadline9"><span class="section-number-2">4</span> 4 Caveats</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>Emacs is single-threaded. If you use Org-Mode to deal with files/shells on
remote systems through a slow connection, you will have to wait during
tangling remote files and executing remote commands.</li>
<li>You don't have to deal with symlinks, and you don't get its benefits. For
example, you change your Git settings through command git config &#x2013;global
&#x2026;. Such changes don't automatically get updated in your Org-Mode file.
It is your responsibility to update your dotfile.org by hand.
<ul class="org-ul">
<li><p>
UPDATE: Ken Mankoff sends me a tip that partially solves the problem.
You can add the following line to the top of your dotfile.org:
</p>

<div class="org-src-container">

<pre class="src src-org"><span style="color: #9f8766;">#+PROPERTY: header-args:conf  :comments link :tangle-mode (identity #o444)</span>
</pre>
</div>

<p>
In Ken's own words: "This makes the files read-only, so I can't edit
them by mistake. It also creates a commented link at the top of each,
so I can jump from the dotfile to its Org origin if I open the dotfile
by mistake." Kudos.
</p></li>
</ul></li>

<li>Your dotfile.org may become to big and unwieldy. For most people this is
not a big deal. On my late-2012 MacBook Pro, opening Org files of a few
hundred KB is as smooth as opening a new file. But if this system is used
for a long time, the files may grow with all those logs and documents. In
that case, you may want to split the files by, say, putting each top-level
headline in a separate file. It is easy to create links to other files in
Org-Mode, so you can still conveniently navigate through all the files.</li>
</ul>
</div>
</div>
